Repository: kirinonakar/TxtAIEditor
Catalog: TxtAIEditor/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

# UnsavedChangesCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# HexViewEnterUnsavedChangesMessage
source: Changes to file '{0}' have not been saved. Save them before switching to Hex view?
zh_hans: 文件“{0}”的更改尚未保存。切换到 Hex 视图前是否保存？
zh_hant: 檔案「{0}」的變更尚未儲存。切換到 Hex 檢視前是否儲存？

# HexViewUnsavedChangesMessage
source: Hex changes to file '{0}' have not been saved. Save them before returning to the normal view?
zh_hans: 文件“{0}”的 Hex 更改尚未保存。返回普通视图前是否保存？
zh_hant: 檔案「{0}」的 Hex 變更尚未儲存。返回一般檢視前是否儲存？

# HexViewUnsavedChangesDiscard
source: Don't save
zh_hans: 不保存
zh_hant: 不儲存

# GitHistoryItemDialogTitle
source: Commit Info [{0}]
ja_jp: コミット情報 [{0}]
zh_hans: 提交信息 [{0}]
zh_hant: 提交資訊 [{0}]

# GitHistoryItemClose
source: Close
ja_jp: 閉じる
zh_hans: 关闭
zh_hant: 關閉

# GitHistoryItemDialogHeader
source: Changed Files (Click to open diff):
ja_jp: 変更されたファイルの一覧 (クリックで比較ビューを開く):
zh_hans: 更改的文件（单击以打开差异）：
zh_hant: 更改的文件（單擊以打開差異）：

# GitCommitSuccessTitle
source: Git Commit
ja_jp: Git コミット
zh_hans: Git 提交
zh_hant: Git 提交

# GitCommitSuccessMessage
source: Successfully committed!
ja_jp: 正常にコミットが完了しました！
zh_hans: 承诺成功！
zh_hant: 承諾成功！

# GitCommitEmptyMessage
source: Please fill in the commit message.
ja_jp: コミットメッセージを入力してください。
zh_hans: 请填写提交信息。
zh_hant: 請填寫提交資料。

# GitCommitFailureTitle
source: Git Commit Failed
ja_jp: Git コミット失敗
zh_hans: Git 提交失败
zh_hant: Git 提交失敗

# GitCommitFailureMessage
source: An error occurred during commit. Please verify if staged changes exist.
ja_jp: コミット中にエラーが発生しました。ステージング済みの変更（Staged）が登録されているか確認してください。
zh_hans: 提交期间发生错误。请验证是否存在分阶段更改。
zh_hant: 提交期間發生錯誤。請驗證是否存在分階段變更。

# GitStageFailureTitle
source: Git Stage Failed
ja_jp: Git ステージング失敗
zh_hans: Git 阶段失败
zh_hant: Git 階段失敗

# GitStageAllFailureMessage
source: Failed to stage all changes.
ja_jp: すべての変更のステージングに失敗しました。
zh_hans: 无法暂存所有更改。
zh_hant: 無法暫存所有變更。

# GitStageToggleFailureTitle
source: Git Stage Change Failed
ja_jp: Git ステージング状態の変更失敗
zh_hans: Git 阶段变更失败
zh_hant: Git 階段變更失敗

# GitStageToggleFailureMessage
source: Failed to process the Git CLI command.
ja_jp: Git CLI コマンドの処理に失敗しました。
zh_hans: 无法处理 Git CLI 命令。
zh_hant: 無法處理 Git CLI 指令。

# GitCommitDetailsFailureTitle
source: Failed to Retrieve Commit Details
ja_jp: コミット詳細の取得に失敗しました
zh_hans: 无法检索提交详细信息
zh_hant: 無法檢索提交詳細信息

# GitInitTitle
source: Git Initialization
ja_jp: Git 初期化
zh_hans: Git 初始化
zh_hant: Git 初始化

# GitInitSelectFolderMessage
source: Please select a folder in the explorer first.
ja_jp: 先にエクスプローラーでフォルダーを選択してください。
zh_hans: 请先在资源管理器中选择一个文件夹。
zh_hant: 請先在資源管理器中選擇一個資料夾。

# GitInitFailureTitle
source: Git Initialization Failed
ja_jp: Git 初期化失敗
zh_hans: Git 初始化失败
zh_hant: Git 初始化失敗

# GitInitFailureMessage
source: Failed to create a Git repository.
ja_jp: Git リポジトリの作成に失敗しました。
zh_hans: 无法创建 Git 存储库。
zh_hant: 無法建立 Git 儲存庫。

# UntitledNewTab
source: Untitled
ja_jp: 無題
zh_hans: 无题
zh_hant: 無題

# GoToLinePlaceholder
source: Enter line number...
ja_jp: 移動する行番号を入力...
zh_hans: Enter 行号...
zh_hant: Enter 行號...

# GoToLineTitle
source: Go to Line
ja_jp: 行へ移動
zh_hans: 前往线路
zh_hant: 前往線路

# GoToLineButton
source: Go
ja_jp: 移動
zh_hans: 去
zh_hant: 去

# GoToLineCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# SnippetInsertErrorTitle
source: Snippet Insertion Error
ja_jp: スニペット挿入エラー
zh_hans: 代码段插入错误
zh_hant: 程式碼段插入錯誤

# SnippetInsertErrorMessage
source: No active text editor window found.
ja_jp: アクティブなテキストエディタウィンドウが見つかりません。
zh_hans: 找不到活动的文本编辑器窗口。
zh_hant: 找不到活動的文字編輯器視窗。

# SnippetAddTitle
source: Add New Code/Formula Snippet
ja_jp: 新しいコード/数式スニペットの追加
zh_hans: 添加新代码/公式片段
zh_hant: 新增程式碼/公式片段

# SnippetAddButton
source: Add
ja_jp: 追加
zh_hans: 添加
zh_hant: 添加

# SnippetEditTitle
source: Edit Snippet
ja_jp: スニペットの編集
zh_hans: 编辑片段
zh_hant: 編輯片段

# SnippetEditSave
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存

# SnippetPlaceholderName
source: Snippet name (e.g. C# Loop)
ja_jp: スニペット名 (例: C# Loop)
zh_hans: 代码段名称（例如 C# 循环）
zh_hant: 程式碼段名稱（例如 C# 循環）

# SnippetPlaceholderKeyword
source: Keyword (e.g. loop)
ja_jp: キーワード (例: loop)
zh_hans: 关键字（例如循环）
zh_hant: 關鍵字（例如循環）

# SnippetPlaceholderDesc
source: Brief description
ja_jp: 簡単な説明
zh_hans: 简要说明
zh_hant: 簡要說明

# SnippetPlaceholderContent
source: Enter code body...
ja_jp: コード本文を入力...
zh_hans: Enter 代码体...
zh_hant: Enter 代碼體...

# SnippetLabelName
source: Snippet Name
ja_jp: スニペット名
zh_hans: 片段名称
zh_hant: 片段名稱

# SnippetLabelKeyword
source: Autocomplete Keyword
ja_jp: 自動補完キーワード
zh_hans: 自动完成关键字
zh_hant: 自動完成關鍵字

# SnippetLabelDesc
source: Description
ja_jp: 説明
zh_hans: 描述
zh_hant: 描述

# SnippetLabelContent
source: Template Content
ja_jp: テンプレート内容
zh_hans: 模板内容
zh_hant: 模板內容

# SnippetCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# CompareSelectFromTab
source: Select from tab...
ja_jp: タブから選択...
zh_hans: 从选项卡中选择...
zh_hant: 從選項卡中選擇...

# CompareOriginalPathPlaceholder
source: Original file path...
ja_jp: 元のファイルのパス...
zh_hans: 原文件路径...
zh_hant: 原始檔案路徑...

# CompareBrowse
source: Browse...
ja_jp: 参照...
zh_hans: 浏览...
zh_hant: 瀏覽...

# CompareModifiedPathPlaceholder
source: Modified file path...
ja_jp: 比較対象ファイルのパス...
zh_hans: 修改后的文件路径...
zh_hant: 修改後的檔案路徑...

# CompareOriginalFileLabel
source: Original File (Original File)
ja_jp: 元のファイル (Original File)
zh_hans: 原始文件（原始文件）
zh_hant: 原始文件（原始文件）

# CompareModifiedFileLabel
source: Modified File (Modified File)
ja_jp: 比較対象ファイル (Modified File)
zh_hans: 修改后的文件（修改后的文件）
zh_hant: 修改後的文件（修改後的文件）

# CompareDialogTitle
source: File Compare (File Compare)
ja_jp: ファイル比較 (File Compare)
zh_hans: 文件比较（文件比较）
zh_hant: 文件比較（文件比較）

# CompareDialogCompareButton
source: Compare
ja_jp: 比較する
zh_hans: 比较
zh_hant: 比較

# CompareDialogCancelButton
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# TextColorPickerTitle
source: Select Text Color
ja_jp: 文字色の選択
zh_hans: 选择文字颜色
zh_hant: 選擇文字顏色

# TextColorApplyButton
source: Apply
ja_jp: 適用
zh_hans: 申请
zh_hant: 申請

# TabMenuCopyFileName
source: Copy File Name
ja_jp: ファイル名をコピー
zh_hans: 复制文件名
zh_hant: 複製檔案名稱

# TabMenuCopyFilePath
source: Copy File Path
ja_jp: パスをコピー
zh_hans: 复制文件路径
zh_hant: 複製檔案路徑

# TabMenuReload
source: Reload
ja_jp: 再読み込み
zh_hans: 重新加载
zh_hant: 重新載入

# TabMenuHexView
source: View as Hex
ja_jp: Hex 表示
zh_hans: 以 Hex 查看
zh_hant: 以 Hex 檢視

# TabMenuEncrypt
source: Encrypt
ja_jp: 暗号化
zh_hans: 加密
zh_hant: 加密

# TabMenuChangeEncryptionPassword
source: Change Password
ja_jp: パスワードを変更
zh_hans: 更改密码
zh_hant: 更改密碼

# TabMenuRemoveEncryption
source: Remove Password
ja_jp: パスワードを解除
zh_hans: 删除密码
zh_hant: 刪除密碼

# EncryptedTabTooltip
source: Encrypted
ja_jp: 暗号化済み
zh_hans: 加密的
zh_hant: 加密的

# EncryptionPasswordDialogTitle
source: Enter Password
ja_jp: パスワード入力
zh_hans: Enter 密码
zh_hant: Enter 密碼

# EncryptionSetPasswordTitle
source: Encrypt
ja_jp: 暗号化
zh_hans: 加密
zh_hant: 加密

# EncryptionChangePasswordTitle
source: Change Password
ja_jp: パスワードを変更
zh_hans: 更改密码
zh_hant: 更改密碼

# EncryptionRemoveTitle
source: Remove Password
ja_jp: パスワードを解除
zh_hans: 删除密码
zh_hant: 刪除密碼

# EncryptionPasswordLabel
source: Password
ja_jp: パスワード
zh_hans: 密码
zh_hant: 密碼

# EncryptionConfirmPasswordLabel
source: Confirm Password
ja_jp: パスワード確認
zh_hans: 确认密码
zh_hant: 確認密碼

# EncryptionCurrentPasswordLabel
source: Current Password
ja_jp: 現在のパスワード
zh_hans: 当前密码
zh_hant: 目前密碼

# EncryptionOpenButton
source: Open
ja_jp: 開く
zh_hans: 打开
zh_hant: 打開

# EncryptionApplyButton
source: Apply
ja_jp: 適用
zh_hans: 申请
zh_hant: 申請

# EncryptionCancelButton
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# EncryptionPasswordEmpty
source: Please enter a password.
ja_jp: パスワードを入力してください。
zh_hans: 请输入密码。
zh_hant: 請輸入密碼。

# EncryptionPasswordMismatch
source: The entered passwords do not match.
ja_jp: 入力したパスワードが一致しません。
zh_hans: 输入的密码不匹配。
zh_hant: 輸入的密碼不符。

# EncryptionCurrentPasswordMismatch
source: The current password is incorrect.
ja_jp: 現在のパスワードが正しくありません。
zh_hans: 当前密码不正确。
zh_hant: 目前密碼不正確。

# EncryptionDialogNotReady
source: The password prompt is not ready. Please try again in a moment.
ja_jp: パスワード入力画面を準備できません。しばらくしてからもう一度お試しください。
zh_hans: 密码提示尚未准备好。请稍后重试。
zh_hant: 密碼提示尚未準備好。請稍後重試。

# TabMenuLivePreview
source: Live Preview
ja_jp: ライブプレビュー
zh_hans: 实时预览
zh_hant: 即時預覽

# LivePreview
source: Live
ja_jp: ライブ
zh_hans: 直播
zh_hant: 直播

# LivePreviewTooltip
source: Live Preview
ja_jp: ライブプレビュー
zh_hans: 实时预览
zh_hant: 即時預覽

# TabMenuAddToFavorites
source: Add to Favorites
ja_jp: お気に入りに追加
zh_hans: 添加到收藏夹
zh_hant: 加入收藏夾

# TabMenuOpenFolder
source: Go to Containing Folder
ja_jp: このフォルダを開く
zh_hans: 转到包含文件夹
zh_hant: 轉到包含資料夾

# TabMenuCloseRight
source: Close Tabs to the Right
ja_jp: 右側のタブを閉じる
zh_hans: 将 Tab 关闭到右侧
zh_hant: 將 Tab 關閉到右側

# TabMenuCloseLeft
source: Close Tabs to the Left
ja_jp: 左側のタブを閉じる
zh_hans: 将 Tab 关闭到左侧
zh_hant: 將 Tab 關閉到左側

# TabMenuCloseOthers
source: Close Other Tabs
ja_jp: 他のタブを閉じる
zh_hans: 关闭其他 Tab
zh_hant: 關閉其他 Tab

# HexViewOpenFailedTitle
source: Hex View Failed
ja_jp: Hex 表示に失敗しました
zh_hans: Hex 查看失败
zh_hant: Hex 檢視失敗

# EditorContextMenuCut
source: Cut
ja_jp: 切り取り
zh_hans: 切
zh_hant: 切

# EditorContextMenuCopy
source: Copy
ja_jp: コピー
zh_hans: 复制
zh_hant: 複製

# EditorContextMenuPaste
source: Paste
ja_jp: 貼り付け
zh_hans: 粘贴
zh_hant: 貼上

# EditorContextMenuDelete
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# EditorContextMenuSelectAll
source: Select All
ja_jp: すべて選択
zh_hans: 选择全部
zh_hant: 選擇全部

# EditorContextMenuToggleComment
source: Toggle Comment
ja_jp: コメントの切り替え
zh_hans: 切换评论
zh_hant: 切換評論

# EditorContextMenuIndent
source: Indent
ja_jp: インデント
zh_hans: 缩进
zh_hant: 縮排

# EditorContextMenuOutdent
source: Outdent
ja_jp: アウトデント
zh_hans: 减少缩进
zh_hant: 減少縮排

# EditorContextMenuLineCleanup
source: Line Cleanup
ja_jp: 行のクリーンアップ
zh_hans: 线路清理
zh_hant: 線路清理

# EditorContextMenuSortAsc
source: Sort Ascending
ja_jp: 昇順で並べ替え
zh_hans: 升序排序
zh_hant: 升序排序

# EditorContextMenuSortDesc
source: Sort Descending
ja_jp: 降順で並べ替え
zh_hans: 降序排序
zh_hant: 降序排序

# EditorContextMenuRemoveDuplicates
source: Remove Duplicate Lines
ja_jp: 重複行の削除
zh_hans: 删除重复行
zh_hant: 刪除重複行

# EditorContextMenuRemoveEmptyLines
source: Remove Empty Lines
ja_jp: 空行の削除
zh_hans: 删除空行
zh_hant: 刪除空白行

# EditorContextMenuCollapseConsecutiveEmptyLines
source: Collapse Consecutive Empty Lines
ja_jp: 連続する空行をまとめる
zh_hans: 折叠连续空行
zh_hant: 折疊連續空行

# EditorContextMenuTrimSpaces
source: Trim Spaces
ja_jp: 前後の空白をトリミング
zh_hans: 修剪空间
zh_hant: 修剪空間

# EditorContextMenuConvert
source: Convert
ja_jp: 変換
zh_hans: 转换
zh_hant: 轉換

# EditorContextMenuToUpperCase
source: To Uppercase
ja_jp: 大文字にする
zh_hans: 转为大写
zh_hant: 轉為大寫

# EditorContextMenuToLowerCase
source: To Lowercase
ja_jp: 小文字にする
zh_hans: 至 Lowercase
zh_hant: 至 Lowercase

# EditorContextMenuToSentenceCase
source: Sentence case
ja_jp: 文頭のみ大文字にする
zh_hans: 句格
zh_hant: 句格

# EditorContextMenuToTitleCase
source: Title case
ja_jp: 各単語の先頭を大文字にする
zh_hans: 标题案例
zh_hant: 標題案例

# EditorContextMenuUrlEncode
source: URL Encode
ja_jp: URLエンコード
zh_hans: URL 编码
zh_hant: URL 編碼

# EditorContextMenuUrlDecode
source: URL Decode
ja_jp: URLデコード
zh_hans: URL 解码
zh_hant: URL 解碼

# EditorContextMenuBase64Encode
source: Base64 Encode
ja_jp: Base64エンコード
zh_hans: Base64 编码
zh_hant: Base64 編碼

# EditorContextMenuBase64Decode
source: Base64 Decode
ja_jp: Base64デコード
zh_hans: Base64解码
zh_hant: Base64解碼

# EditorContextMenuHexToDec
source: HEX → DEC
ja_jp: 16進数 → 10進数
zh_hans: 十六进制 → 十进制
zh_hant: 十六進位 → 十進位

# EditorContextMenuDecToHex
source: DEC → HEX
ja_jp: 10進数 → 16進数
zh_hans: 十进制 → 十六进制
zh_hant: 十進制 → 十六進位

# EditorContextMenuFormatText
source: Format text
ja_jp: テキストの整形
zh_hans: 设置文本格式
zh_hant: 設定文字格式

# EditorContextMenuScrollSync
source: Scroll Sync
ja_jp: スクロール同期
zh_hans: 滚动同步
zh_hant: 滾動同步

# EditorAutocompleteSnippet
source: Snippet
ja_jp: スニペット
zh_hans: 片段
zh_hant: 片段

# EditorAutocompleteSnippetPrefix
source: Snippet:
ja_jp: スニペット:
zh_hans: 片段：
zh_hant: 片段：

# DiffCompareToolTitle
source: TxtAIEditor File Compare Tool (File Compare)
ja_jp: TxtAIEditor ファイル比較ツール (File Compare)
zh_hans: TxtAIEditor 文件比较工具（文件比较）
zh_hant: TxtAIEditor 檔案比較工具（檔案比較）

# DiffStatsGathering
source: Gathering...
ja_jp: 収集中...
zh_hans: 聚集...
zh_hant: 聚集...

# DiffOriginalFileLabel
source: Original File (Original)
ja_jp: 元のファイル (Original)
zh_hans: 原始文件（原始）
zh_hant: 原始文件（原始）

# DiffModifiedFileLabel
source: Modified File (Modified)
ja_jp: 比較対象ファイル (Modified)
zh_hans: 修改后的文件（已修改）
zh_hant: 修改後的文件（已修改）

# DiffOriginalPrefix
source: Original:
ja_jp: 元のファイル:
zh_hans: 原文：
zh_hant: 原文：

# DiffModifiedPrefix
source: Modified:
ja_jp: 修正ファイル:
zh_hans: 修改：
zh_hant: 修改：

# DiffStatsFormat
source: Changes: {0} additions, {1} deletions
ja_jp: 変更箇所: 追加 {0} 行, 削除 {1} 行
zh_hans: 更改：{0} 添加，{1} 删除
zh_hant: 更改：{0} 添加，{1} 刪除

# DiffOpenFileTooltip
source: Open file
ja_jp: ファイルを開く
zh_hans: 打开文件
zh_hant: 開啟文件

# GitPreviousCommitFormat
source: {0} (Previous Commit)
ja_jp: {0} (前回のコミット)
zh_hans: {0}（上一次提交）
zh_hant: {0}（上次提交）

# GitCommitHashFormat
source: {0} (Commit {1})
ja_jp: {0} (コミット {1})
zh_hans: {0}（提交 {1}）
zh_hant: {0}（提交 {1}）

# GitCompareTitleFormat
source: Compare [{0}]: {1}
ja_jp: 比較 [{0}]: {1}
zh_hans: 比较[{0}]：{1}
zh_hant: 比較[{0}]：{1}

# GitCompareDiffTitleFormat
source: Git Compare: {0}
ja_jp: Git 比較: {0}
zh_hans: Git 比较：{0}
zh_hant: Git 比較：{0}

# GitPreviousVersionFormat
source: {0} (Previous Version)
ja_jp: {0} (以前のバージョン)
zh_hans: {0}（先前版本）
zh_hant: {0}（前版）

# GitCurrentChangesFormat
source: {0} (Current Changes)
ja_jp: {0} (現在の変更点)
zh_hans: {0}（当前更改）
zh_hant: {0}（目前變更）

# SearchReplaceOneTooltip
source: Replace only this item
ja_jp: この項目だけ置換
zh_hans: 仅替换此项目
zh_hant: 僅替換此項目

# SnippetExport
source: Export
ja_jp: エクスポート
zh_hans: 出口
zh_hant: 出口

# SnippetImport
source: Import
ja_jp: インポート
zh_hans: 进口
zh_hant: 進口

# SnippetImportErrorTitle
source: Snippet Import Error
ja_jp: スニペットインポートエラー
zh_hans: 代码片段导入错误
zh_hant: 程式碼片段導入錯誤

# SnippetImportErrorMessage
source: An error occurred while importing the file: {0}
ja_jp: ファイルのインポート中にエラーが発生しました: {0}
zh_hans: 导入文件时出错：{0}
zh_hant: 匯入檔案時發生錯誤：{0}

# SnippetReset
source: Reset
ja_jp: リセット
zh_hans: 重置
zh_hant: 重置

# SnippetResetTitle
source: Reset Snippets
ja_jp: スニペットのリセット
zh_hans: 重置片段
zh_hant: 重置片段

# SnippetResetConfirm
source: Reset to default snippets? All custom snippets will be deleted.
ja_jp: デフォルトのスニペットにリセットしますか？ カスタムスニペットはすべて削除されます。
zh_hans: 重置为默认片段？所有自定义片段都将被删除。
zh_hant: 重置為預設片段？所有自訂片段都將被刪除。

# SnippetResetConfirmButton
source: Reset
ja_jp: リセット
zh_hans: 重置
zh_hant: 重置

# TOC
source: Table of Contents
ja_jp: 目次
zh_hans: PHZZ0ZZ目录页
zh_hant: PHZZ0ZZ目錄頁

# TOCHeader
source: Table of Contents
ja_jp: 目次
zh_hans: PHZZ0ZZ目录页
zh_hant: PHZZ0ZZ目錄頁

# SnippetEditTooltip
source: Edit
ja_jp: 編集
zh_hans: 编辑
zh_hant: 編輯

# SnippetDeleteTooltip
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# AutocompleteDict
source: Autocomplete Dictionary...
ja_jp: 自動補完辞書...
zh_hans: 自动完成词典...
zh_hant: 自動完成字典...

# AutocompleteDictTitle
source: Edit Autocomplete Dictionary
ja_jp: 自動補完辞書の編集
zh_hans: 编辑自动完成词典
zh_hant: 編輯自動完成字典

# AutocompleteDictSave
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存

# AutocompleteDictPlaceholder
source: Enter one word per line...
ja_jp: 1行に1単語ずつ入力...
zh_hans: Enter 每行一个字...
zh_hant: Enter 每行一個字...

# AutocompleteDictLabel
source: Autocomplete Word List
ja_jp: 自動補完単語リスト
zh_hans: 自动完成单词列表
zh_hant: 自動完成單字列表

# AutocompleteDictHint
source: Each word entered on a line will appear as an autocomplete candidate in the editor.
ja_jp: 各行に入力した単語がエディタの自動補完候補として表示されます。
zh_hans: 一行中输入的每个单词都将在编辑器中显示为自动完成候选词。
zh_hant: 一行中輸入的每個單字都將在編輯器中顯示為自動完成候選單字。

# StickyNoteTitle
source: Sticky Note
ja_jp: 付箋モード
zh_hans: 便利贴
zh_hant: 便利貼

# ExitStickyNoteTooltip
source: Exit Sticky Note Mode (F12)
ja_jp: 付箋モード終了 (F12)
zh_hans: 退出便签模式 (F12)
zh_hant: 退出便條模式 (F12)

# ExitStickyNoteText
source: Exit
ja_jp: 終了
zh_hans: 退出
zh_hant: 退出

source: Terminal Exited
ja_jp: ターミナル終了
zh_hans: 终端已退出
zh_hant: 終端已退出

# TerminalStartFailed
source: Failed to start terminal
ja_jp: ターミナルの起動に失敗しました
zh_hans: 无法启动终端
zh_hant: 無法啟動終端

source: Terminal has exited
ja_jp: ターミナルが終了しました
zh_hans: 终端已退出
zh_hant: 終端已退出

# TerminalSendFailed
source: Failed to send command
ja_jp: コマンド送信失敗
zh_hans: 发送命令失败
zh_hant: 發送命令失敗

# ExplorerCopyFileName
source: Copy File Name
ja_jp: ファイル名をコピー
zh_hans: 复制文件名
zh_hant: 複製檔案名稱

# ExplorerCopyFilePath
source: Copy File Path
ja_jp: パスをコピー
zh_hans: 复制文件路径
zh_hant: 複製檔案路徑

# ExplorerExtractArchiveToFolder
source: Extract to folder
ja_jp: フォルダーに展開
zh_hans: 解压到文件夹
zh_hant: 解壓縮到資料夾

# ExplorerExtractArchiveToFolderFormat
source: Extract to {0} folder
ja_jp: {0} フォルダーに展開
zh_hans: 解压到 {0} 文件夹
zh_hant: 解壓縮到 {0} 資料夾

# ExplorerCompressFolderToZip
source: Compress to ZIP
ja_jp: ZIP に圧縮
zh_hans: 压缩为 ZIP
zh_hant: 壓縮為 ZIP

# ExplorerCompressFolderToSevenZip
source: Compress to 7z
ja_jp: 7z に圧縮
zh_hans: 压缩为 7z
zh_hant: 壓縮為 7z

# ArchiveProgressCompressing
source: [{0}] Compressing...
zh_hans: [{0}] 正在压缩...
zh_hant: [{0}] 正在壓縮...

# ArchiveProgressExtracting
source: [{0}] Extracting...
zh_hans: [{0}] 正在解压...
zh_hant: [{0}] 正在解壓縮...

# StatusProgressCancelTooltip
source: Cancel operation
zh_hans: 中止操作
zh_hant: 中止操作

# ArchiveCreateFailedTitle
source: Failed to create archive
ja_jp: 圧縮ファイルの作成に失敗しました
zh_hans: 创建压缩文件失败
zh_hant: 建立壓縮檔失敗

# ArchiveCreateRootFolderNotSupported
source: A drive root folder cannot be compressed.
ja_jp: ドライブのルートフォルダーは圧縮できません。
zh_hans: 无法压缩驱动器根文件夹。
zh_hant: 無法壓縮磁碟機根資料夾。

# ArchiveCreateTargetDirectoryExistsFormat
source: A folder named '{0}' already exists, so the archive cannot be created.
ja_jp: '{0}' という名前のフォルダーが既にあるため、圧縮ファイルを作成できません。
zh_hans: 已存在名为“{0}”的文件夹，无法创建压缩文件。
zh_hant: 已存在名為「{0}」的資料夾，無法建立壓縮檔。

# ArchiveCreateOverwriteTitle
source: Confirm archive overwrite
ja_jp: 圧縮ファイルの上書き確認
zh_hans: 确认覆盖压缩文件
zh_hant: 確認覆寫壓縮檔

# ArchiveCreateOverwriteMessageFormat
source: The file '{0}' already exists. Overwrite it?
ja_jp: '{0}' ファイルは既に存在します。上書きしますか?
zh_hans: 文件“{0}”已存在。是否覆盖？
zh_hant: 檔案「{0}」已存在。是否覆寫？

# ArchiveCreateOverwriteOK
source: Overwrite
ja_jp: 上書き
zh_hans: 覆盖
zh_hant: 覆寫

# ArchiveExtractFailedTitle
source: Failed to extract archive
ja_jp: 圧縮ファイルの展開に失敗しました
zh_hans: 解压缩文件失败
zh_hant: 解壓縮檔失敗

# ArchiveExtractTargetFileExistsFormat
source: A file named '{0}' already exists, so the archive cannot be extracted.
ja_jp: '{0}' という名前のファイルが既にあるため展開できません。
zh_hans: 已存在名为“{0}”的文件，无法解压缩。
zh_hant: 已存在名為「{0}」的檔案，無法解壓縮。

# ArchiveExtractOverwriteTitle
source: Confirm extraction
ja_jp: 展開の確認
zh_hans: 确认解压
zh_hant: 確認解壓縮

# ArchiveExtractOverwriteMessageFormat
source: The folder '{0}' already exists. Extract and overwrite existing files?
ja_jp: '{0}' フォルダーは既に存在します。既存のファイルを上書きして展開しますか?
zh_hans: “{0}”文件夹已存在。是否解压并覆盖现有文件？
zh_hant: 「{0}」資料夾已存在。是否解壓縮並覆寫現有檔案？

# ArchiveExtractOverwriteOK
source: Extract
ja_jp: 展開
zh_hans: 解压
zh_hant: 解壓縮

# ExplorerCreateFolderTooltip
source: New Folder
ja_jp: 新しいフォルダ
zh_hans: 新建文件夹
zh_hant: 新建資料夾

# CreateFolderDialogTitle
source: New Folder
ja_jp: 新しいフォルダ
zh_hans: 新建文件夹
zh_hant: 新建資料夾

# CreateFolderPlaceholder
source: Enter folder name...
ja_jp: フォルダ名を入力...
zh_hans: Enter 文件夹名称...
zh_hant: Enter 資料夾名稱...

# CreateFolderDialogCreate
source: Create
ja_jp: 作成
zh_hans: 创建
zh_hant: 創建

# CreateFolderDialogCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# CreateFolderErrorTitle
source: New Folder Error
ja_jp: 新しいフォルダの作成エラー
zh_hans: 新文件夹错误
zh_hant: 新資料夾錯誤

# CreateFolderNoFolderSelected
source: Please select a folder in Explorer first.
ja_jp: 先にエクスプローラーでフォルダを選択してください。
zh_hans: 请先在资源管理器中选择一个文件夹。
zh_hant: 請先在資源管理器中選擇一個資料夾。

# CreateFolderEmptyName
source: Please enter a folder name.
ja_jp: フォルダ名を入力してください。
zh_hans: 请输入文件夹名称。
zh_hant: 請輸入資料夾名稱。

# CreateFolderInvalidName
source: The folder name contains characters that cannot be used.
ja_jp: フォルダ名に使用できない文字が含まれています。
zh_hans: 文件夹名称包含不能使用的字符。
zh_hant: 資料夾名稱包含不能使用的字元。

# CreateFolderAlreadyExists
source: '{0}' already exists.
ja_jp: '{0}' は既に存在します。
zh_hans: “{0}”已存在。
zh_hant: “{0}”已存在。

# ExplorerRefreshTooltip
source: Refresh
ja_jp: 更新
zh_hans: 刷新
zh_hant: 重新整理

# ExplorerCopyFolderPath
source: Copy Folder Path
ja_jp: フォルダパスをコピー
zh_hans: 复制文件夹路径
zh_hant: 複製資料夾路徑

# ExplorerRename
source: Rename
ja_jp: 名前の変更
zh_hans: 重命名
zh_hant: 重新命名

# ExplorerDelete
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# RenameDialogTitle
source: Rename
ja_jp: 名前の変更
zh_hans: 重命名
zh_hant: 重新命名

# RenameDialogOK
source: OK
zh_hans: 好的
zh_hant: 好的

# RenameDialogCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# RenameErrorTitle
source: Rename Error
ja_jp: 名前の変更エラー
zh_hans: 重命名错误
zh_hant: 重新命名錯誤

# DeleteConfirmTitle
source: Confirm Delete
ja_jp: 削除の確認
zh_hans: 确认删除
zh_hant: 確認刪除

# DeleteConfirmMessage
source: Move '{0}' to Recycle Bin?
ja_jp: '{0}'をごみ箱に移動しますか？
zh_hans: 将“{0}”移至回收站？
zh_hant: 將“{0}”移至回收站？

# DeleteConfirmOK
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# DeleteConfirmCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# DeleteErrorTitle
source: Delete Error
ja_jp: 削除エラー
zh_hans: 删除错误
zh_hant: 刪除錯誤

# LlmPresetButtonText
source: Preset
ja_jp: プリセット
zh_hans: 预设
zh_hant: 預設

# LlmPresetButtonTooltip
source: Instruction preset list
ja_jp: 指示事項のプリセット一覧
zh_hans: 指令预设列表
zh_hant: 指令預設列表

# LlmPresetAddText
source: Add Preset
ja_jp: プリセット追加
zh_hans: 添加预设
zh_hant: 新增預設

# LlmPresetApplyText
source: Apply
ja_jp: 適用
zh_hans: 申请
zh_hant: 申請

# LlmPresetDeleteText
source: Delete
ja_jp: 削除
zh_hans: 删除
zh_hant: 刪除

# LlmPresetSaveTitle
source: Add current tab as preset
ja_jp: 現在のタブをプリセットとして追加
zh_hans: 添加当前选项卡作为预设
zh_hant: 新增目前選項卡作為預設

# LlmPresetSavePlaceholder
source: Enter preset name...
ja_jp: プリセット名を入力...
zh_hans: Enter 预设名称...
zh_hant: Enter 預設名稱...

# LlmPresetSaveLabel
source: Preset Name
ja_jp: プリセット名
zh_hans: 预设名称
zh_hant: 預設名稱

# LlmPresetSaveAddButton
source: Add
ja_jp: 追加
zh_hans: 添加
zh_hant: 添加

# LlmPresetSaveCancelButton
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# LlmPresetNameEmptyTitle
source: Add Preset Error
ja_jp: プリセット追加エラー
zh_hans: 添加预设错误
zh_hant: 新增預設錯誤

# LlmPresetNameEmptyMessage
source: Please enter a preset name.
ja_jp: プリセット名を入力してください。
zh_hans: 请输入预设名称。
zh_hant: 請輸入預設名稱。

# LlmPresetDuplicateTitle
source: Duplicate Preset
ja_jp: プリセットの重複
zh_hans: 重复预设
zh_hant: 重複預設

# LlmPresetDuplicateMessage
source: A preset with this name already exists. Do you want to overwrite it?
ja_jp: 同じ名前のプリセットが既に存在します。上書きしますか？
zh_hans: 具有此名称的预设已存在。您想覆盖它吗？
zh_hant: 具有此名稱的預設已存在。您想覆蓋它嗎？

# LlmPresetContentLabel
source: Preset Content
ja_jp: プリセットの内容
zh_hans: 预设内容
zh_hant: 預設內容

# LlmPresetContentPlaceholder
source: Preset content...
ja_jp: プリセットの内容...
zh_hans: 预设内容...
zh_hant: 預設內容...

# LlmPresetEditTitle
source: Edit Preset
ja_jp: プリセットの編集
zh_hans: 编辑预设
zh_hant: 編輯預設

# LlmPresetEditSaveButton
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存

# ExpandPreviewTooltip
source: Expand Preview
ja_jp: プレビューを拡大
zh_hans: 展开预览
zh_hant: 展開預覽

# LlmMaxInstructionsReached
source: You can create a maximum of 4 instruction tabs. Please delete an existing tab and try again.
ja_jp: 指示事項タブは最大4つまで作成できます。既存のタブを削除してからやり直してください。
zh_hans: 您最多可以创建 4 个说明选项卡。请删除现有选项卡并重试。
zh_hant: 您最多可以建立 4 個說明標籤。請刪除現有選項卡並重試。

# LlmPresetPlaceholderFormat
source: [{0}] Preset applied. Enter additional instructions...
ja_jp: [{0}] プリセット適用。追加の指示事項を入力...
zh_hans: [{0}] 应用预设。 Enter 附加说明...
zh_hant: [{0}] 應用預設。 Enter 附加說明...

# PresetExportText
source: Export
ja_jp: エクスポート
zh_hans: 导出
zh_hant: 匯出

# PresetImportText
source: Import
ja_jp: インポート
zh_hans: 导入
zh_hant: 匯入

# PresetExportErrorTitle
source: Preset Export Error
ja_jp: プリセットのエクスポートエラー
zh_hans: 预设导出错误
zh_hant: 預設導出錯誤

# PresetExportErrorMessage
source: An error occurred while exporting presets: {0}
ja_jp: プリセットのエクスポート中にエラーが発生しました: {0}
zh_hans: 导出预设时出错：{0}
zh_hant: 匯出預設時發生錯誤：{0}

# PresetImportErrorTitle
source: Preset Import Error
ja_jp: プリセットのインポートエラー
zh_hans: 预设导入错误
zh_hant: 預設導入錯誤

# PresetImportErrorMessage
source: An error occurred while importing presets: {0}
ja_jp: プリセットのインポート中にエラーが発生しました: {0}
zh_hans: 导入预设时出错：{0}
zh_hant: 匯入預設時發生錯誤：{0}
